# **SQL METHODS**

In SQL, methods refer to functions or procedures that perform specific tasks within your queries. They are like pre-defined tools that you can use to manipulate, analyze, or interact with your data in various ways.

#### **Import SQLite3**

In [2]:
import sqlite3

#### **Connect to the SQLite Database**
If you want to create the database file in the current directory (where your Jupyter Notebook is located) and specify the name of the database file, you can do it like this:

In [3]:
conn = sqlite3.connect('sqlite-crud.db')
cursor = conn.cursor()

### **SELECT**

The SELECT statement in SQL retrieves data from one or more tables, allowing users to specify columns to fetch and apply filters, sorting, and aggregations to manipulate the data returned.

In [ ]:
cursor.execute("SELECT * FROM employees")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

### **DISTINCT**

The **DISTINCT** keyword is used to return only distinct (unique) values in the result set of a query. It ensures that duplicate rows are removed from the output.

In [ ]:
cursor.execute("SELECT DISTINCT department FROM employees")
cursor.fetchall()

[('Sales',), ('Marketing',), ('Operations',), ('IT',), ('Finance',), ('HR',)]

### **LIMIT**

The **LIMIT** clause specifies the maximum number of rows to return in a query result.

In [ ]:
cursor.execute("SELECT * FROM employees LIMIT 5")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1)]

### **COUNT**

The **COUNT** function is used to count the number of rows in a table or the number of rows matching a specific condition.

In [ ]:
cursor.execute("SELECT COUNT(*) FROM employees")
cursor.fetchall()

[(30,)]

In [ ]:
cursor.execute("SELECT COUNT(DISTINCT department) FROM employees")
cursor.fetchall()

[(6,)]

### **WHERE**

The **WHERE** clause is used to filter data retrieved from a database based on specific conditions.

### **Comparison Operators:**
#### `=`: Equal to

In [ ]:
# Get the employees that is working at the IT department
cursor.execute("SELECT * FROM employees WHERE department = 'IT'")
cursor.fetchall()

[(6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4)]

#### `!=` : Not equal to

In [ ]:
# Get all the employees that is not working at the IT department
cursor.execute("SELECT * FROM employees WHERE department != 'IT'")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

#### `<` : Less than

In [ ]:
# Select employess that have poor performance
cursor.execute("SELECT * FROM employees WHERE performance_rating < 3")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

#### `>` : Greater than

In [ ]:
# Select employees that have a great performance
cursor.execute("SELECT * FROM employees WHERE performance_rating > 3")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5)]

#### `<=` : Less than or equal to

In [ ]:
cursor.execute("SELECT * FROM employees WHERE salary <= 59000")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2)]

#### `>=` : Greater than or equal to

In [ ]:
# Select all the employees that has salary of greater than or equal to 60000
cursor.execute("SELECT * FROM employees WHERE salary >= 60000")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

### **Logical Operators:**
#### `AND`: Used to combine multiple conditions where both must be true.

In [ ]:
# Employees working under sales department and have a performance rating greater than 3
cursor.execute("""
SELECT * FROM employees
WHERE department = 'Sales' AND performance_rating > 3
""")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5)]

#### `OR`: Used to combine multiple conditions where at least one must be true.

In [ ]:
# Select all the employees that is working under the operations or marketing department
cursor.execute("""
SELECT * FROM employees 
WHERE department = 'Operations' OR department = 'Marketing'
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

#### `NOT`: Used to negate a condition.

In [ ]:
# Get the employees that are NOT in department of IT
cursor.execute("SELECT * FROM employees WHERE NOT department = 'IT'")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

### **Special Operators:**
#### `BETWEEN`: Checks if a value falls within a specified range.

In [ ]:
cursor.execute("""
SELECT * FROM employees
WHERE salary BETWEEN 60000 and 65000
""")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

#### `IN`: Checks if a value belongs to a set of values.

In [ ]:
cursor.execute("""
SELECT * FROM employees
WHERE department IN ('Operations', 'Marketing')
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

#### `LIKE`: Used for pattern matching with wildcards.

In [ ]:
# % - wildcard
# string - pattern
# %string - ending substring/pattern
cursor.execute("""
SELECT * FROM employees
WHERE last_name LIKE '%son'
""")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2)]

In [ ]:
# string% - starting substring/pattern
cursor.execute("""
SELECT * FROM employees
WHERE first_name LIKE 'ja%'
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4)]

In [ ]:
# %string% - contains the substring
cursor.execute("""
SELECT * FROM employees
WHERE hire_date LIKE '%-04-%'
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3)]

### **ORDER BY**

The **ORDER BY** clause allows you to sort the results of your SELECT queries in either ascending or descending order. It lets you sort the retrieved data based on one or more columns, making it easier to analyze and interpret.

#### `ASC:` Ascending order (lowest to highest). (Default)

In [ ]:
cursor.execute("""
SELECT * FROM employees
ORDER BY last_name ASC
""")
cursor.fetchall()

[(25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2)]

#### `DESC:` Descending order (highest to lowest).

In [ ]:
# sort the data based on the highest to lowest salary
cursor.execute("SELECT * FROM employees order by salary DESC")
cursor.fetchall()

[(28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5)]

In [ ]:
# sort the data based on department ascending and salary descending
cursor.execute("SELECT * FROM employees order by department ASC, salary DESC")
cursor.fetchall()

[(29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (1, 'John', 'Doe', 'Sales', 65000, '1997-01-07', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5)]

### **GROUP BY**

The **GROUP BY** clause is used to organize and summarize data by grouping rows with the same values in one or more columns. This helps you analyze trends, patterns, and aggregate statistics within your data.

#### Grouping with `COUNT()`

In [ ]:
# Get the number of employees under each department
cursor.execute("""
SELECT department, COUNT()
FROM employees
GROUP BY department
""")
cursor.fetchall()

[('Finance', 5),
 ('HR', 4),
 ('IT', 5),
 ('Marketing', 5),
 ('Operations', 5),
 ('Sales', 6)]

#### Grouping with `SUM()`

In [ ]:
# Total budget for salary in each department
cursor.execute("""
SELECT department, SUM(salary)
FROM employees
GROUP BY department
""")
cursor.fetchall()

[('Finance', 324000),
 ('HR', 214000),
 ('IT', 350000),
 ('Marketing', 302000),
 ('Operations', 291000),
 ('Sales', 375000)]

#### Grouping with `AVG()`

In [ ]:
# Average salary of an employee for each department
cursor.execute("""
SELECT department, AVG(salary)
FROM employees
GROUP BY department
ORDER BY salary DESC
""")
cursor.fetchall()

[('IT', 70000.0),
 ('Sales', 62500.0),
 ('Finance', 64800.0),
 ('Operations', 58200.0),
 ('Marketing', 60400.0),
 ('HR', 53500.0)]

#### Grouping with `MAX()` and `MIN()`